InformationRegisters/ПодписанныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПодписанныеДанные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СоставПодписи</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписанныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеАктуальны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверкиДанных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписанныеДанныеФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодписанныеДанныеПОД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаПоОбработкеДокумента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПодписанныеДанные/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьЗадачиСДаннымиВХранилищеЗначений(Дата = Неопределено) Экспорт
	МассивЗадач = Новый Массив();   
	
	ДатаФормирования = ?(Не ЗначениеЗаполнено(Дата), Дата(2999,12,31), Дата);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаФормирования);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачаПоОбработкеДокумента.Ссылка КАК Задача,
	|	ЗадачаПоОбработкеДокумента.Этап КАК Этап,
	|	ЗадачаПоОбработкеДокумента.Этап.Наименование КАК НаименованиеЭтапа,
	|	РегистрСведенийПодписанныеДанные.СоставПодписи КАК СоставПодписи,
	|	РегистрСведенийПодписанныеДанные.ПодписанныеДанные КАК ПодписанныеДанные,
	|	РегистрСведенийПодписанныеДанные.ДанныеАктуальны КАК ДанныеАктуальны,
	|	РегистрСведенийПодписанныеДанные.ДатаПроверкиДанных КАК ДатаПроверкиДанных,
	|	РегистрСведенийПодписанныеДанные.ОписаниеОшибки КАК ОписаниеОшибки,
	|	РегистрСведенийПодписанныеДанные.ПодписанныеДанныеФайл КАК ПодписанныеДанныеФайл
	|ИЗ
	|	Задача.ЗадачаПоОбработкеДокумента КАК ЗадачаПоОбработкеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПодписанныеДанные КАК РегистрСведенийПодписанныеДанные
	|		ПО (РегистрСведенийПодписанныеДанные.Задача = ЗадачаПоОбработкеДокумента.Ссылка
	|			И РегистрСведенийПодписанныеДанные.ПодписанныеДанныеФайл = Значение(Справочник.ПодписанныеДанныеПОД.ПустаяСсылка))
	|ГДЕ
	|	ЗадачаПоОбработкеДокумента.ПодписанЭП
	|	И ЗадачаПоОбработкеДокумента.Дата < &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗадачаПоОбработкеДокумента.Дата";	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Если ЗначениеЗаполнено(Выборка.ПодписанныеДанные) Тогда
			ДвоичныеДанные = Выборка.ПодписанныеДанные.Получить(); 
			Если ДвоичныеДанные <> Неопределено Тогда
	        	МассивЗадач.Добавить(Выборка.Задача); 
			КонецЕсли;
		 КонецЕсли;
		  
	КонецЦикла;

	Возврат МассивЗадач;
	
КонецФункции

#КонецОбласти

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПолучитьЗадачиСДаннымиВХранилищеЗначений", Истина);
КонецПроцедуры

#КонецЕсли
